<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Patches files.</string>
    <key>Identifier</key>
    <string>com.github.ccaviness.processors</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array/>
</dict>
</plist>
