<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download Okta Verify, copy to versioned package, and import into Munki.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.

This recipe is based off of nstrauss' excellent OktaVerify.munki recipe:
https://github.com/autopkg/nstrauss-recipes/blob/master/Okta%20Verify/OktaVerify.munki.recipe</string>
		<key>Identifier</key>
		<string>com.github.ccaviness.munki.OktaVerifyNoRelocate</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>OktaVerify</string>
			<key>MUNKI_CATEGORY</key>
			<string>Security</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/OktaVerify</string>
			<key>DERIVE_MIN_OS</key>
			<string>YES</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Okta Verify is a lightweight multifactor authentication app that is used to register your device to Okta. Registering your device to Okta gives you passwordless authentication to apps, strong device-level security, and more.</string>
				<key>developer</key>
				<string>Okta</string>
				<key>display_name</key>
				<string>Okta Verify</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>uninstall_method</key>
				<string>uninstall_script</string>
				<key>uninstall_script</key>
				<string>#!/bin/zsh
/usr/bin/killall "Okta Verify"
/bin/rm -rf "/Applications/Okta Verify.app"
pkgutil --forget com.okta.mobile
exit 0
				</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.7</string>
		<key>ParentRecipe</key>
		<string>com.github.ccaviness.pkg.OktaVerifyNoRelocate</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>derive_minimum_os_version</key>
					<string>%DERIVE_MIN_OS%</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Applications/Okta Verify.app</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%.%ov_build%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
