<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Creates a versioned OktaVerify package with bundle relocation disabled.

This unpacks and rebuilds the package using the PkgCreator processor, resulting in a non-relocatable package.
The package will no longer be signed after this modification.

This recipe is based off of nstrauss' excellent OktaVerify.pkg recipe:
https://github.com/autopkg/nstrauss-recipes/blob/master/Okta%20Verify/OktaVerify.pkg.recipe</string>
		<key>Identifier</key>
		<string>com.github.ccaviness.pkg.OktaVerifyNoRelocate</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>OktaVerify</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.nstrauss.download.OktaVerify</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Okta Verify.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Okta Verify.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Okta Verify.app/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleVersion</key>
						<string>ov_build</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PlistReader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<key>pkgname</key>
						<string>%NAME%-%version%.%ov_build%</string>
						<key>id</key>
						<string>com.okta.mobile</string>
						<key>scripts</key>
						<string>%RECIPE_CACHE_DIR%/unpack/Okta Verify.pkg/scripts</string>
						<key>version</key>
						<string>%version%.%ov_build%</string>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
					</array>
				</dict>
				<key>Comment</key>
				<string>%RECIPE_CACHE_DIR%/payload is used in .munki to create the installs key.</string>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
