<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ChatGPT and imports into Munki as a pkg.</string>
	<key>Identifier</key>
	<string>com.github.ccaviness.munki.ChatGPT-pkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ChatGPT</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>ChatGPT is free, syncs your history across devices, and brings you the newest model improvements from OpenAI. The ChatGPT desktop app for macOS is designed to integrate seamlessly into anything you&apos;re doing on your computer.</string>
			<key>display_name</key>
			<string>ChatGPT</string>
			<key>category</key>
			<string>Productivity</string>
			<key>developer</key>
			<string>ChatGPT</string>
			<key>minimum_os_version</key>
			<string>14</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>arm64</string>
			</array>
			<key>unattended_install</key>
			<true/>
  		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.ccaviness.pkg.ChatGPT</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>additional_pkginfo</key>
			<dict>
				<key>installs</key>
				<array>
					<dict>
						<key>path</key>
						<string>/Applications/ChatGPT.app</string>
						<key>type</key>
						<string>application</string>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
