<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Symphony and imports into Munki as a pkg.</string>
	<key>Identifier</key>
	<string>com.github.ccaviness.munki.Symphony</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Symphony</string>
		<key>SYMPHONY_POD_URL</key>
		<string/>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Symphony: The only secure and compliant collaboration platform built for financial markets &amp; trading teams.</string>
			<key>developer</key>
			<string>Symphony</string>
			<key>display_name</key>
			<string>Symphony</string>
			<key>minimum_os_version</key>
			<string>14</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>preinstall_script</key>
			<string>#!/bin/sh
# Set the POD_URL to the POD_URL value in the recipe, if it is set.
# See https://support.symphony.com/hc/en-us/articles/360054396791-Silent-install-of-Symphony-MacOS
POD_URL="%SYMPHONY_POD_URL%"
if [[ -n "${POD_URL}" ]]; then
	echo "${POD_URL}" &gt;/tmp/sym_settings.txt
fi
exit 0
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.ccaviness.download.Symphony</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Applications/Symphony.app</string>
							<key>type</key>
							<string>application</string>
						</dict>
					</array>
                    <key>version</key>
                    <string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
