<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Symphony.</string>
	<key>Identifier</key>
	<string>com.github.ccaviness.download.Symphony</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://symphony.com/support/downloads/</string>
		<key>NAME</key>
		<string>Symphony</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>href="(?P&lt;url&gt;https://resources\.symphony\.com/(?P&lt;filename&gt;SymphonyDesktopApplication-macOS-(?P&lt;version&gt;[0-9.]+)\.pkg))"</string>
                <key>result_output_var_name</key>
                <string>pkg_download_url</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>   
            <key>Arguments</key>   
            <dict>   
                <key>input_path</key>   
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Symphony Communication Services LLC (BUX8SV4LQA)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
        </dict>
    </array>
</dict>
</plist>