<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the specified version of elastic-agent.

Use the ELASTIC_ARCH ('aarch64' or 'x86_64') and ELASTIC_VERSION input values to configure the version of elastic-agent to download.
</string>
	<key>Identifier</key>
	<string>com.github.ccaviness.download.elastic-agent</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://artifacts.elastic.co/downloads/beats/elastic-agent</string>
		<key>ELASTIC_ARCH</key>
		<string></string>
		<key>ELASTIC_VERSION</key>
		<string></string>
		<key>NAME</key>
		<string>elastic-agent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%/elastic-agent-%ELASTIC_VERSION%-darwin-%ELASTIC_ARCH%.tar.gz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/elastic-agent-%ELASTIC_VERSION%-darwin-%ELASTIC_ARCH%/elastic-agent</string>
				<key>requirement</key>
				<string>identifier "co.elastic.elastic-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BT3HPN62Z"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
