<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Uploads an elastic-agent pkg to munki.

Use the ELASTIC_URL and ELASTIC_ENROLLMENT_TOKEN input values to configure the elastic-search enrollment settings.
</string>
		<key>Identifier</key>
		<string>com.github.ccaviness.munki.elastic-agent</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_CATEGORY</key>
			<string>Security</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/elastic-agent</string>
			<key>DERIVE_MIN_OS</key>
			<string>YES</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Elastic Agent is a single, unified way to add monitoring for logs, metrics, and other types of data to a host.</string>
				<key>developer</key>
				<string>Okta</string>
				<key>display_name</key>
				<string>Elastic Agent</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>uninstall_method</key>
				<string>uninstall_script</string>
				<key>uninstall_script</key>
				<string>#!/bin/zsh
/usr/bin/killall "Okta Verify"
/bin/rm -rf "/Applications/Okta Verify.app"
pkgutil --forget com.okta.mobile
exit 0
				</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.7</string>
		<key>ParentRecipe</key>
		<string>com.github.ccaviness.pkg.elastic-agent</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
						<key>installcheck_script</key>
						<string>#!/bin/bash

set -eu

INSTALLED=1
NOT_INSTALLED=0
ELASTIC_AGENT=&quot;/Library/Elastic/Agent/elastic-agent&quot;
ELASTIC_AGENT_VERSION_STRING=$(&quot;${ELASTIC_AGENT}&quot; version || echo &quot;Binary: 0.0&quot;)
ELASTIC_AGENT_VERSION=$(awk '$1 == &quot;Binary:&quot; { print $2 }' &lt;&lt;&lt; &quot;${ELASTIC_AGENT_VERSION_STRING}&quot; || echo &quot;0.0&quot;)
OFFERED_VERSION=&quot;%version%&quot;

echo &quot;Elastic Agent version: ${ELASTIC_AGENT_VERSION}&quot;
echo &quot;Offered version: ${OFFERED_VERSION}&quot;

function version_gte() {
    # shellcheck disable=SC2312
    [[ &quot;$1&quot; == &quot;$2&quot; || &quot;$(printf '%s\n' &quot;$@&quot; | sort -V | head -n 1)&quot; != &quot;$1&quot; ]]
}

# Non-zero exit codes indicate that the item in question is installed
# shellcheck disable=SC2310
if version_gte &quot;${ELASTIC_AGENT_VERSION}&quot; &quot;${OFFERED_VERSION}&quot;; then
    echo &quot;Elastic Agent version is up-to-date&quot;
    exit &quot;${INSTALLED}&quot;
else
    echo &quot;Elastic Agent version is not up-to-date&quot;
    exit &quot;${NOT_INSTALLED}&quot;
fi
						</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
