<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of enterprise Kolide launcher and imports into Munki as a pkg.</string>
		<key>Identifier</key>
		<string>com.github.ccaviness.munki.Kolide</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Utilities</string>
				<key>description</key>
				<string>Kolide is a powerful tool to help your company reach its compliance goals through the power of end-user self-remediation. We leverage the principles of Zero Trust to block a device from accessing your company's SaaS apps and other resources if it isn't running the Kolide agent or passing specific requirements.</string>
				<key>developer</key>
				<string>Kolide</string>
				<key>display_name</key>
				<string>Kolide</string>
				<key>minimum_os_version</key>
				<string>11</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true />
				<key>version_script</key>
				<string><![CDATA[#!/bin/bash

if [[ -e /usr/local/kolide-k2/Kolide.app/Contents/Info.plist ]]; then
    plutil -extract CFBundleShortVersionString raw /usr/local/kolide-k2/Kolide.app/Contents/Info.plist | sed 's/^v//'
fi]]>
</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.ccaviness.download.Kolide</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>blocking_applications</key>
						<array />
						<key>installs</key>
						<array>
							<dict>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
								<key>path</key>
								<string>/usr/local/kolide-k2/Kolide.app</string>
								<key>type</key>
								<string>application</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
