Description: Downloads the latest version the pre-enrolled enterprise Kolide launcher.
  You must provide a Kolide API bearer token as `KOLIDE_TOKEN`.
Identifier: com.github.ccaviness.download.Kolide
MinimumVersion: '2.3'

Input:
  NAME: kolide-launcher
  DOWNLOAD_URL: https://api.kolide.com/package_downloads/darwin-launchd-pkg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%.pkg'
      url: '%DOWNLOAD_URL%'
      request_headers:
        accept: 'application/json'
        x-kolide-api-version: '2023-05-26'
        authorization: 'Bearer %KOLIDE_TOKEN%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_authority_names:
        - 'Developer ID Installer: Kolide, Inc (X98UFR7HA3)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/expanded'
      flat_pkg_path: '%pathname%'
      skip_payload: false

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/expanded/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      pkg_payload_path: '%found_filename%/Payload'
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/usr/local/kolide-k2/Kolide.app/Contents/Info.plist'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
