<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version the pre-enrolled enterprise Kolide launcher. You must
			provide a Kolide API bearer token as `KOLIDE_TOKEN`.</string>
		<key>Identifier</key>
		<string>com.github.ccaviness.download.Kolide</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>https://api.kolide.com/package_downloads/darwin-launchd-pkg</string>
			<key>NAME</key>
			<string>kolide-launcher</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>request_headers</key>
					<dict>
						<key>accept</key>
						<string>application/json</string>
						<key>authorization</key>
						<string>Bearer %KOLIDE_TOKEN%</string>
						<key>x-kolide-api-version</key>
						<string>2023-05-26</string>
					</dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Kolide, Inc (X98UFR7HA3)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>skip_payload</key>
					<false />
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/expanded/*.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>pkg_payload_path</key>
					<string>%found_filename%/Payload</string>
					<key>purge_destination</key>
					<true />
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/usr/local/kolide-k2/Kolide.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>source_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/expanded</string>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
