Description: Downloads the latest version of enterprise Kolide launcher and imports into Munki as a
  pkg.
Identifier: com.github.ccaviness.munki.Kolide
MinimumVersion: '2.3'
ParentRecipe: com.github.ccaviness.download.Kolide

Input:
  MUNKI_REPO_SUBDIR: apps
  # NAME: kolide-launcher
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: Kolide is a powerful tool to help your company reach its compliance goals
      through the power of end-user self-remediation. We leverage the principles of Zero 
      Trust to block a device from accessing your company's SaaS apps and other resources
      if it isn't running the Kolide agent or passing specific requirements.
    developer: Kolide
    display_name: Kolide
    minimum_os_version: '11'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiPkginfoMerger
    Arguments:
      additional_pkginfo:
        installs:
        - CFBundleShortVersionString: '%version%'
          path: /usr/local/kolide-k2/Kolide.app
          type: application

  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
      version_comparison_key: CFBundleShortVersionString
