Description: Downloads the latest version of Twingate.
Identifier: com.github.ccaviness.download.Twingate
MinimumVersion: '2.3'

Input:
  NAME: Twingate
  DOWNLOAD_URL: https://api.twingate.com/download/darwin?installer=pkg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%.pkg'
      url: '%DOWNLOAD_URL%'
    
  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      requirement: 'anchor apple generic and identifier "com.twingate.macos" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6GX8KVTR9H")'

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/expanded'
      flat_pkg_path: '%pathname%'
        
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/expanded/Distribution.pkg/Payload'
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/Twingate.app/Contents/Info.plist'
      plist_version_key: 'CFBundleShortVersionString'

  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: '%RECIPE_CACHE_DIR%/expanded/Distribution.pkg'
      destination_pkg: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
