Description: Downloads the latest version of Twingate and imports into Munki as a
  pkg.
Identifier: com.github.ccaviness.munki.Twingate
MinimumVersion: '2.3'
ParentRecipe: com.github.ccaviness.download.Twingate

Input:
  MUNKI_REPO_SUBDIR: apps
  NAME: Twingate
  pkginfo:
    catalogs:
    - testing
    category: Remote Access
    description: Twingate is the most secure way to provide encrypted, least privileged
      access to any cloud (AWS, Azure or Google Cloud Platform) or on-premise application
      or resource. Twingate allows you to secure all access regardless of device platform
      or network.
    developer: Twingate
    display_name: Twingate
    minimum_os_version: '14'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiPkginfoMerger
    Arguments:
      additional_pkginfo:
        installs:
        - CFBundleShortVersionString: '%version%'
          path: /Applications/Twingate.app
          type: application

  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
      version_comparison_key: CFBundleShortVersionString
